Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/legal_aid_and_advice/criminal_legal_aid.html.txt.tmx
Source language: en
Languages: ga

source: • Other legal aid schemes
ga: • Scéimeanna cúnaimh dhlíthiúil eile

source: In Ireland if your constitutional right to legal representation applies and you don't have the means to pay for legal representation, then the State (or Government) is obliged to provide that legal representation
ga: Tá ceart bunreachtúil i gceist in Éirinn maidir le hionadaíocht dhlíthiúil agus mura bhfuil na hacmhainní agat íoc as an ionadaíocht dhlíthiúil, tá dualgas ar an Stát (nó Rialtas) ionadaíocht dhlíthiúil a sholáthar

source: The Supreme Court has held that there is a need to put the defendant on equal terms with the prosecution
ga: Chinn an an Chúirt Uachtarach go raibh gá leis an gcosantóir a chur ar chomhchéim leis an ionchúiseamh

source: Without legal representation, an ordinary person without any experience of criminal law and court proceedings would be at a serious disadvantage up against the legal resources of the prosecution
ga: Gan ionadaíocht dhlíthiúil, bheadh míbhuntáiste ollmhór ag an ngnáthdhuine, gan taithí ar an dlí coiriúil agus imeachtaí cúirte, in aghaidh acmhainní dlí an ionchúisimh

source: It is interesting to note that the Supreme Court decided that it is only in certain circumstances that somone has a constitutional right to legal representation
ga: Is suimiúil a shonrú gur chinn an Chúirt Uachtarach nach raibh an ceart bunreachtúil ag duine d'ionadaíocht dhlíthiúil, ach amháin i gcúinsí áirithe

source: There is no absolute constitutional right to it
ga: Níl aon cheart iomlán i gceist maidir lena leithéid

source: The main legal aid available to someone accused of a crime is the legal aid provided under the Criminal Justice (Legal Aid) Act 1962
ga: Is é an príomh-cúnamh dlíthiúil ar fáil do dhuine cúisithe i gcoir an cúnamh dlíthiúil ar fáil faoin tAcht um Cheartas Coiriúil (Cúnamh Dlíthiúil) 1962

source: Criminal legal aid, unlike civil legal aid, is free
ga: Tá cabhair dhlíthiúil choiriúil saor in aisce, rud nach bhfuil i gceist le cabhair dhlíthiúil shibhialta

source: No financial contribution is necessary
ga: Níl aon ranníocaíocht airgeadais de dhíth

source: If a judge considers that it is appropriate that you are granted criminal legal aid, you will be issued a legal aid certificate
ga: Má bhreithníonn an breitheamh gur cheart cabhair dhlíthiúil choiriúil a dheonú duit, déanfar deimhniú cabhrach dlí a dheonú duit

source: However, in some cases a legal aid certificate may not be available. In those cases you may be entitled to apply for free legal representation under another scheme such as the Criminal Assets Bureau's Ad-Hoc Legal Aid Scheme or the Attorney General's Scheme
ga: Mar sin féin, i gcásanna áirithe nuair nach bhfuil Deimhniú Cabhrach Dlí ar fáil, d'fhéadfadh duine a bheith i dteideal iarratas a dhéanamh ar ionadaíocht dhlíthiúil in aisce faoi scéim eile cosúil le Scéim an Ard-Aighne

source: (See 'Other legal aid schemes' below)
ga: (Féach 'scéimeanna cúnaimh dlíthiúil eile' thíos)

source: All criminal cases in Ireland start in either the District Court or the Special Criminal Court
ga: Tosaíonn gach cás coiriúil in Éirinn sa Chúirt Dúiche nó sa Chúirt Choiriúil Speisialta

source: The majority of cases start in the District Court
ga: Tosaíonn tromlach na gcásanna sa Chúirt Dúiche

source: It is at this stage that you are entitled to apply for legal aid
ga: Is ag an staid seo atá tú i dteideal iarratas a dhéanamh ar chabhair dhlí

source: If a charge carries a possible prison sentence and you, as the defendant, are not legally represented, the District Court judge is required to inform you that you may be entitled to legal aid
ga: Má thugann cúiseamh téarma príosúnachta féideartha leis, agus mura bhfuil ionadaíocht dhlíthiúil agat mar chosantóir, tá dualgas ar bhreitheamh na Cúirte Dúiche insint duit go bhféadfá a bheith i dteideal cabhair dhlí

source: If you wish to be legally represented and you claim that you can't afford it, the judge must consider whether you qualify for free legal aid
ga: Más mian leat ionadaíocht dhlíthiúil a bheith agat agus má mhaíonn tú nach bhfuil na hacmhainní agat, caithfidh an breitheamh cinneadh a dhéanamh an gcáilíonn tú do chabhair dhlí in aisce

source: What are the factors the judge must consider?
ga: Na tosca atá le breithniú ag an mbreitheamh?

source: In deciding whether or not you qualify for free legal aid under the criminal legal aid scheme, the judge must consider the following:
ga: Nuair atá cinneadh á dhéanamh maidir le hincháilitheacht do chabhair dhlí in aisce, caithfidh an breitheamh na nithe a leanas a mheas:

source: • Whether your means are enough to enable you to pay for your own legal aid
ga: • An bhfuil na hacmhainní agat a gcuirfeadh ar do chumas íoc as cabhair dhlí

source: • Given the seriousness of the charge or offence, whether it is in the interest of justice that you should have legal aid in the preparation and conduct of your defence
ga: • Ag brath ar thromchúis an chúisimh nó an chionta, cibé an bhfuil sé chun leasa an cheartais go mbeadh cabhair dhlí agat, maidir le hullmhú agus stiúradh an chosanta agat

source: Normally an application for legal aid will be as straightforward as explaining to the judge that you are unemployed and give them details of your social welfare payments, or if you are on a low income, your salary
ga: Bíonn iarratas ar chabhair dhlí go hiondúil chomh héasca le míniú a thabhairt do bhreitheamh go bhfuil tú dífhostaithe, agus sonraí a thabhairt maidir le híocaíochtaí leasa shóisialaigh, nó do thuarastal má tá ioncam íseal á thuilleamh agat

source: Sometimes the judge will ask a prosecuting Garda if the Gardaí have any objections to legal aid being granted
ga: Iarrfaidh an breitheamh ar an nGarda ionchúisimh uaireanta, an bhfuil agóidí ar bith ag na Gardaí maidir le deonú na cabhrach dlí

source: The Gardaí will rarely object unless they have proof that you are being untruthful to the court about your means
ga: Is annamh a dhéanfaidh na Gardaí agóid, murach fianaise a bheith ann go bhfuil bréag á insint don chúirt faoi do chuid acmhainní

source: In the case of a young person the court will look at the means of the parents or guardian to see if they can afford to pay for the legal advice
ga: I gcás ógánaigh, breathnóidh an chúirt ar acmhainní na dtuismitheoirí nó an chaomhnóra, chun féachaint an bhfuil sé inacmhainne dóibh íoc as comhairle dlí

source: The court may require a written statement from you setting out your income, family circumstances and any other relevant details
ga: D'fhéadfadh ráiteas scríofa uait a bheith de dhíth ar an gcúirt, ina leagtar amach an t-ioncam, na cúinsí teaghlaigh agus sonraí ábharthacha ar bith eile a bhaineann leat

source: This written statement must be made on a form which is available from the District Court clerk at the District Court offices
ga: Caithfear an ráiteas scríofa seo a dhéanamh ar fhoirm atá ar fáil ó chléireach na Cúirte Dúiche in oifigí na Cúirte Dúiche

source: It is an offence for you to knowingly make a false statement or a false representation either verbally or in writing or to conceal any important fact from the judge in relation to your application for legal aid
ga: Is cion atá ann ráiteas bréagach nó uiríoll bréagach a dhéanamh go feasach, ó bhéal nó i scríbhinn, nó fíric thábhachtach ar bith a cheilt ón mbreitheamh maidir leis an iarratas uait ar chabhair dhlí

source: If you are found guilty of this offence you are liable on conviction to a class C fine or to imprisonment for up to six months (or to both)
ga: Má fhaightear ciontach thú sa chion seo, dlífear rang C fíneáil nó príosúnacht suas le sé mhí (nó an dá cheann) a chur ort

source: So, for example, if you tell a judge that you are unemployed (and are granted legal aid) but it later transpires that you were working at the time, you are guilty of an offence
ga: Má dheireann tú le breitheamh go bhfuil tú dífhostaithe mar shampla (agus go ndéantar cabhair dhlí a dheonú duit), ach go dtugtar le fios níos déanaí go raibh tú ag obair ag an am, tá tú ciontach i gcion

source: If the judge considers that it is appropriate that legal aid is granted, you will be issued a legal aid certificate
ga: Má bhreithníonn an breitheamh gur cheart cabhair dhlí a dheonú duit, déanfar deimhniú cabhrach dlí a dheonú duit

source: In what cases is legal aid granted?
ga: Cásanna ina ndéantar cabhair dhlí a dheonú?

source: Generally the rule is that if the offence is a serious one and you can’t afford to pay for your own legal advice, then the court grants a legal aid certificate
ga: An riail ghinearálta atá ann ná nuair a bhíonn cion tromchúiseach i gceist agus nach bhfuil sé inacmhainne agat íoc as comhairle dlí, déanann an chúirt deimhniú cabhrach dlí a dheonú

source: In assessing the seriousness of the case the judge considers the possibility of you receiving a prison sentence or large fine if convicted
ga: Nuair atá tromchúis an cháis á mheasúnú, déanann an breitheamh an fhéidearthacht a mheas go bhfaighidh tú téarma príosúnachta nó fíneáil mhór, má chiontaítear tú i leith an chiona

source: If the offence is not a serious one, the judge may grant legal aid in exceptional circumstances
ga: Mura cion tromchúiseach atá i gceist, d'fhéadfadh an breitheamh cabhair dhlí a dheonú i gcúinsí eisceachtúla

source: Such exceptional circumstances include the following:
ga: Áirítear i measc na gcúinsí eisceachtúla seo:

source: • If you are very ill
ga: • Má tá tú fíorbhreoite

source: • If you are immature
ga: • Má tá tú anabaí

source: • If you lack any formal education
ga: • Má tá easpa oideachais foirmiúil ort

source: • If you are emotionally disturbed or lack the mental capacity to understand the process of the court case
ga: • Má tá tú suaite go mothúchánach nó easpa inniúlachta meabhrach ort chun próiseas an cháis cúirte a thuiscint

source: In what cases is legal aid not granted?
ga: Cad iad na cásanna nach ndéantar cabhair dhlí a dheonú?

source: A District Court judge will normally refuse to grant a legal aid certificate in the following circumstances:
ga: Is iondúil a dhiúltóidh breitheamh na Cúirte Dúiche do dheimhniú cabhrach dlí a dheonú sna cúinsí a leanas:

source: • Where the judge is of the view that the matters before the court are not serious enough
ga: • Nuair atá an breitheamh den tuairim nach bhfuil na saincheisteanna atá os comhair na cúirte sách tromchúiseach

source: For example, road traffic offences and other minor offences
ga: Mar shampla, cionta um thrácht ar bhóithre agus mionchionta eile

source: • Where the judge is of the view that you have enough means to pay for your own legal representation
ga: • Nuair atá an breitheamh den tuairim go bhfuil dóthain acmhainní agat le h-íoc as d'ionadaíocht dhlíthiúil féin

source: • Most judicial review proceedings
ga: • Tromlach na n-imeachtaí athbhreithnithe bhreithiúnaigh

source: In some cases, however, where a legal aid certificate is not available, a person may be entitled to apply for free legal representation under another scheme such as the Attorney General's Scheme
ga: Mar sin féin, i gcásanna áirithe nuair nach bhfuil Deimhniú Cabhrach Dlí ar fáil, d'fhéadfadh duine a bheith i dteideal iarratas a dhéanamh ar ionadaíocht dhlíthiúil in aisce faoi scéim eile cosúil le Scéim an Ard-Aighne

source: You can find information on other free legal aid schemes below
ga: Is féidir leat eolas a fháil ar scéimeanna eile cúnamh dlíthiúil saor in aisce thíos

source: Can I appeal the refusal by a judge to grant me legal aid?
ga: An féidir liom achomharc a dhéanamh ar dhiúltú breithimh cabhair dhlí a dheonú dom?

source: No, there is no appeal procedure for the refusal of criminal legal aid
ga: Ní féidir a leithéid a dhéanamh, toisc nach bhfuil aon nós imeachta achomhairc do dhiúltú na cabhrach dlíthiúla coiriúla

source: You can however make another application in a higher court if the matter is sent forward for hearing to a higher court
ga: Mar sin féin, is féidir leat iarratas eile a dhéanamh chuig cúirt níos airde, má dhéantar an cheist a sheoladh ar aghaidh le héisteacht i gcúirt níos airde

source: Legal aid granted in the District Court only covers District Court proceedings
ga: Ní chlúdaíonn cabhair dhlí a deonaíodh sa Chúirt Dúiche ach imeachtaí na Cúirte Dúiche amháin

source: If you are sent forward to a higher court by the District Court to have your case dealt with and you have already been granted free legal aid, it will be necessary for you to apply to that higher court for legal aid for your trial
ga: Má sheoltar ar aghaidh chuig cúirt níos airde tú ón gCúirt Dúiche chun déileáil le do chás, agus má deonaíodh cabhair dhlí in aisce duit cheana féin, beidh sé riachtanach duit iarratas a dhéanamh ar an gcúirt níos airde chun cabhair dhlí a fháil don triail agat

source: It is very unlikely that the higher court would refuse to grant a legal aid certificate if the District Court has already granted a certificate
ga: Is fíor-annamh a dhéanfadh cúirt níos airde deonú an deimhnithe cabhrach dlí a dhiúltú, má tá deimhniú cheana féin deonaithe ag an gCúirt Dúiche

source: Can I choose my solicitor?
ga: An féidir liom mo rogha aturnae?

source: If you have been granted criminal legal aid, the judge assigns a solicitor to your case from the legal aid panel
ga: Má tá do thriail choiriúil le tarlú in Éirinn agus go bhfuil cabhair dhlíthiúil choiriúil deonaithe ag an mbreitheamh duit, déanann an breitheamh aturnae a shannadh dod' chás ón bpainéal cabhrach dlí

source: If you express a desire to be represented by a particular solicitor from the panel, the judge assigns that solicitor if he/she is available
ga: Má chuireann tú in iúl gur mian leat go ndéanfadh aturnae áirithe ón bpainéal ionadaíocht ort, déanfaidh an breitheamh an aturnae sin a shannadh má tá sé/sí ar fáil

source: The constitutional right, however, to free legal aid for certain defendants does not extend to an absolute right to choose a particular solicitor or barrister
ga: Mar sin féin, ní shíneann an ceart bunreachtúil atá ag cosantóirí áirithe chomh fada le ceart daingean maidir le haturnae nó abhcóide áirithe a roghnú

source: There is no specific legal obligation on either solicitors or barristers to participate in the free legal scheme
ga: Níl aon dualgas dlíthiúil faoi leith ar aturnaetha nó abhcóidí a bheith rannpháirteach sa scéim saorchabhrach dlí

source: Each county registrar is obliged to compile and maintain a list of solicitors who are willing to participate in the scheme in the courts within their area
ga: Tá dualgas ar gach cláraitheoir contae liosta aturnaetha a thiomsú agus a chothabháil a bheidh rannpháirteach go toilteanach sa scéim sna cúirteanna laistigh dá gceantar féin

source: The Minister for Justice and Equality also compiles and maintains a similar list of barristers (nominated by the Bar Council) as being willing to participate in the legal aid scheme
ga: Déanann an tAire Dlí agus Cirt agus Comhionannais liosta comhchosúil d'abhcóidí (ainmnithe ag Comhairle Bharra na hÉireann a bheidh rannpháirteach go toilteanach sa scéim cabhrach dlí

source: Although you have no absolute right to choose a solicitor, the courts very rarely refuse to assign the solicitor sought by a defendant
ga: Cé nach bhfuil aon cheart daingean agat maidir le haturnae a roghnú, is annamh a dhiúltaíonn na cúirteanna aturnae a shannadh atá iarrtha ag an gcosantóir

source: This is so long as the solicitor is on the legal aid panel and is available
ga: Tá sé seo amhlaidh chomh fada agus go bhfuil an t-aturnae ar fáil agus ar an bpainéal cabhrach dlí

source: If a judge refuses to assign a solicitor nominated by you, the court must state the reason and should then enquire whether you wishe to nominate any other solicitor
ga: Má dhiúltaíonn breitheamh aturnae atá ainmnithe agat a shannadh, caithfidh an chúirt cúis a thabhairt, agus fiosrú ansin ar mhaith leat aon aturnae eile a ainmniú

source: What costs does the scheme cover?
ga: Cad costais atá clúdaithe?

source: When a legal aid certificate is granted for court proceedings it entitles you to free legal aid for fees, costs or expenses which are incurred in the preparation of and the conduct of your defence
ga: Nuair atá deimhniú cabhrach dlí deonaithe d'imeachtaí cúirte, tá tú i dteideal cabhair dhlí atá saor in aisce maidir le táillí, costais nó speansais a tabhaíodh le linn do chosaint a bheith á hullmhú nó á stiúradh

source: It also covers the cost of an appeal or a case stated
ga: Clúdaíonn sé costas achomhairc nó cás sonraithe chomh maith

source: The fees included are those of a solicitor and in certain circumstances, up to two counsel or barristers
ga: Is ionann na táillí atá san áireamh agus cinn a bhaineann le haturnae agus suas le beirt abhcóidí i gcúinsí áirithe

source: The legal aid certificate also covers the fees of non-legal professionals who may be required for the preparation and conduct of your defence
ga: Clúdaíonn an deimhniú cabhrach dlí táillí na ngairmithe neamhdhlíthiúla a d'fhéadfadh a bheith riachtanach maidir le hullmhú agus stiúradh do chosanta

source: Examples of these are:
ga: Áirítear na samplaí a leanas ina measc:

source: In a case where a defence solicitor or barrister considers the services of such experts are necessary, their expenses are covered by the legal aid certificate
ga: Nuair a bhreithníonn aturnae nó abhcóide cosanta go bhfuil seirbhísí ó shaineolaithe mar seo riachtanach, bíonn na costais clúdaithe ag an deimhniú cabhrach dlí

source: In almost all cases, the application for criminal legal aid is made on your first appearance in the District Court
ga: I dtromlach na gcásanna, déantar an t-iarratas ar chabhair dhlí in asice ar do chéad láithreas os comhair na Cúirte Dúiche

source: The judge informs you of your right to free legal aid and it is at this stage that the application is made by you
ga: Cuireann an breitheamh in iúl duit faoin gceart atá agat do chabhair dhlí in aisce agus is ag an staid seo a dhéanann tú iarratas

source: If your case is sent forward to a higher court for hearing (for example the Circuit Court), your solicitor (if one was assigned to you in the District Court) will apply to the Circuit Court for legal aid on your behalf
ga: Má dhéantar do chás a sheoladh ar aghaidh chuig cúirt níos airde le héisteacht (an Chúirt Dúiche mar shampla), déanfaidh do aturnae (má sannadh ceann duit sa Chúirt Dúiche) iarratas ar chabhair dhlí chun na Cúirte Dúiche ar do shon

source: Other legal aid schemes
ga: Scéimeanna cúnaimh dhlíthiúil eile

source: In those cases where you are not entitled to a legal aid certificate under the criminal legal aid scheme,you may be entitled to apply for free legal representation under another scheme
ga: Sna cásanna sin nuair nach bhfuil tú i dteideal deimhniú um chúnamh dlíthiúil faoin scéim um chúnamh dlíthiúil coiriúil, féadfaidh tú a bheith i dteideal iarratas a dhéanamh ar ionadaíocht dlí saor in aisce faoi scéim eile

source: Legal Aid - Custody Issues Scheme
ga: Cúnamh Dlíthiúil - Scéim Saincheisteanna a Choimeád

source: The Legal Aid - Custody Issues Scheme (formerly known as the Attorney General’s Scheme) is a non-statutory scheme which cover the fees payable to a solicitor and barrister representing a person in certain criminal matters where that person cannot afford to pay the fees themselves
ga: Is scéim neamhreachtúil í Cúnamh Dlíthiúil - Scéim Saincheisteanna a Choimeád (scéim an Ard-Aighne mar a dtugtar roimhe seo). Faoin scéim seo, íoctar na táillí aturnae agus abhcóide a bhaineann le hionadaíocht a dhéanamh do dhuine cúisithe i gcás coiriúil, nuair nach féidir leis an duine cúisithe na táillí seo a íoc

source: The scheme is administered by the Legal Aid Board
ga: Tá an scéim seo faoi riarachán an Bord um Chúnamh Dlíthiúil

source: The scheme applies to the following matters
ga: Baineann an scéim leis na cásanna seo a leanas:

source: • Applications for bail in the High Court or the Supreme Court
ga: • Iarratais ar bhannaí san Ard-Chúirt nó Chúirt Uachtarach

source: • Judicial review proceedings which are concerned with criminal matters or matters where the liberty of the person is at issue
ga: • Imeachtaí athbhreithniúcháin dlíthiúla a bhaineann le hábhair choiriúla nó nuair a bhíonn téarma príosúnachta i gceist

source: • Applications under the Extradition Act 1965 and the European Arrest Warrant Act 2003
ga: • Iarratais faoin Acht um Eiseachadach 1965 agus faoin Acht um Barántas Gabhála Eorpach 2003

source: • Habeas Corpus applications (brought by a person who claims that they are being unlawfully detained by the state)
ga: • Iarratais Habeas Corpus (a thionscnaíonn duine nuair a cheapann siad go gcoimeádtar iad go neamhdhleathach)

source: Legal Aid is available under the scheme whenever the applicant's means are not sufficient to obtain the appropriate and necessary legal representation and the court in question considers it necessary and proper that a solicitor and barrister should be assigned to that person to make submissions on behalf of that person in their application to the court
ga: Is féidir le daoine cúnamh dlí a fháil faoin scéim, nuair nach féidir leo na costais a íoc a bhaineann le hionadaíocht dhleathach iomchuí a fháil, agus nuair a mheasann an chúirt áirithe gur gá aturnae agus abhcóide a cheapadh chun aighneachtaí a chur isteach ar son an duine sin sa chúirt

source: To apply for funding under the scheme, you personally, or through your legal representative, must make an application to the court for a recommendation for funding under the scheme at the start of proceedings
ga: Chun iarratas a chur isteach ar mhaoiniú scéime, ní mór duit féin nó dod’ionadaí dleathach iarratas a chur isteach chuig an chúirt chun maoiniú scéime a fháil ag tús na n-imeachtaí

source: Further information on the scheme is available on the Legal Aid Board’s website
ga: Tá breis faisnéise ar fáil ar an scéim ar láithreán gréasáin an Bhoird um Chúnamh Dlíthiúil

source: Ad-Hoc Legal Aid Scheme (CAB)
ga: Scéim Chúnaimh Dhlí Ad-Hoc (CAB)

source: The Department of Justice and Equality operates the Criminal Assets Bureau (CAB) Ad-Hoc Legal Aid Scheme which provides legal aid to people who are defendants in any court proceedings brought by the Criminal Assets Bureau, including court proceedings under the Proceeds of Crime Act 1996, Revenue Acts or Social Welfare Acts
ga: Is í an Roinn Dlí agus Cirt agus Comhionannais atá freagrach as Scéim Chúnaimh Dhlí Ad-Hoc (CAB) an Bhiúró um Shócmhainní Coiriúla a fheidhmiú. Tugann an scéim seo cúnamh dlí do chosantóirí in imeachtaí cúirte a thionscnaíonn an Biúró um Shócmhainní Coiriúla, lena n-airítear imeachtaí cúirte faoin Acht um Fháltais Choiriúla 1996, faoi na hAchtanna Ioncaim nó faoi na hAchtanna Leasa Shóisialaigh

source: The scheme also includes:
ga: Íoctar do na hiarratais seo a leanas faoin scéim freisin:

source: • Social welfare appeals made to the Circuit Court under Section 307 of the Social Welfare Consolidation Act 2005
ga: • Achomhairc leasa shóisialaigh a tugadh os comhair na Cúirte Cuarda faoi Alt 307 den Acht Leasa Shóisialaigh (Comhdhlúthú) 2005

source: • Tax appeals made to the Circuit Court under the Taxes Acts where the Criminal Assets Bureau is the defendant
ga: • Achomhairc chánach a tugadh os comhair na Cúirte Cuarda faoi na hAchtanna Cánach, i gcásanna nach mbíonn an Biúró um Shócmhainní Coiriúla mar chosantóir

source: • Applications made by the Director of Public Prosecutions under Section 39 of the Criminal Justice Act 1994
ga: • Iarratais ón Stiúrthóir Ionchúiseamh Poiblí faoi Alt 39 den Acht um Cheartas Coiriúil 1994
